# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPBuildingConstructionSet..::..Erase Method
MEPBuildingConstructionSet Class See Also
---
Removes a specified MEPBuildingConstruction from the set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	MEPBuildingConstruction item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As MEPBuildingConstruction _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	MEPBuildingConstruction^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Mechanical..::..MEPBuildingConstructionThe MEPBuildingConstruction to be erased.
# ### Return Value
The number of MEPBuildingConstructions that were erased from the set.
# See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace